Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetConduitSizeSettingsIterator
Returns a ConduitSizeSettingIterator to the conduit size settings.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettings.RemoveConduitStandardType(Autodesk.Revit.DB.Document,System.String)
Erases the existing ConduitSizes with this conduit standard name; the consuit standard type can not be removed if it is in use.
pADoc:
The document.
standardName:
The conduit standard name.
Returns:
True if removing success; otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The conduit standard is already in use.
-or-
The conduit standard is the last one.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettings.DoesConduitStandardTypeExist(System.String)
Checks if the specified conduit standard exist.
standardName:
The conduit standard name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettings.CreateConduitStandardTypeFromExisingStandardType(Autodesk.Revit.DB.Document,System.String,System.String)
Creates one conduit standard type with the new name and assign the conduit sizes to it from the existing standard type.
pADoc:
The document.
newStandardName:
The new conduit standard name.
existingStandardName:
The existing conduit standard name.
Returns:
True if creating success; otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The conduit standard name already exists.
-or-
The conduit standard name does not exist.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettings.RemoveSize(System.String,System.Double)
Erase the existing ConduitSize with this nominal diameter. The conduit standard name determines the location of the size in the size table.
Remarks:
Does nothing if there is no existing ConduitSize with this nominal diameter.
standardName:
The conduit standard name.
nominalDiameter:
Nominal diameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for nominalDiameter must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The function is called during iterating the size set.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettings.AddSize(System.String,Autodesk.Revit.DB.Electrical.ConduitSize)
Inserts a new ConduitSize in to the conduit size settings. The conduit standard name determines the location of the new size in the size table.
standardName:
The conduit standard name.
sizeInfo:
The new ConduitSize to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The conduit standard name does not exist.
-or-
The conduit size already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The function is called during iterating the size set.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetSizeCount(System.String)
Gets the size count of the conduit size table. The conduit standard name the location of the size in the size table.
standardName:
The conduit standard name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetConduitSizeSettings(Autodesk.Revit.DB.Document)
Gets the conduit size settings of the project.
aDoc:
The document.
Returns:
The conduit size settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettings
Conduit sizes settings
Since:
2017